# Student Alcohol Consumption

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the datasets *student-mat* and *student-por* and merge them.

In [2]:
student_mat = pd.read_csv("C:\\Users\\375930\\Python\\Python Course\\Assignment\\2. Pandas Basic Exercises\\Exercise Data Files\\Pandas Exercise Lambda Functions Files\student-mat.csv")
student_por = pd.read_csv("C:\\Users\\375930\\Python\\Python Course\\Assignment\\2. Pandas Basic Exercises\\Exercise Data Files\\Pandas Exercise Lambda Functions Files\student-por.csv")

In [49]:
df = student_mat
df = df.append(student_por,ignore_index=True)

### Step 3. Assign it to a variable called df.

In [50]:
df.head(2)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6

In [51]:
print(student_mat.shape)
print(student_por.shape)
print(df.shape)

(395, 33)
(649, 33)
(1044, 33)

### Step 4. For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column

In [52]:
col=['school', 'sex', 'age', 'address', 'famsize', 'Pstatus', 'Medu', 'Fedu','Mjob', 'Fjob', 'reason', 'guardian']
df = df[col]
df.head(3)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,course,mother
1,GP,F,17,U,GT3,T,1,1,at_home,other,course,father
2,GP,F,15,U,LE3,T,1,1,at_home,other,other,mother

### Step 5. Create a lambda function that captalize strings.

In [53]:
df1 = df[["school","sex","address","famsize","Pstatus","Mjob","Fjob","reason","guardian"]].applymap(lambda x:x.upper())
df1.head(3)

  school sex address famsize Pstatus     Mjob     Fjob  reason guardian
0     GP   F       U     GT3       A  AT_HOME  TEACHER  COURSE   MOTHER
1     GP   F       U     GT3       T  AT_HOME    OTHER  COURSE   FATHER
2     GP   F       U     LE3       T  AT_HOME    OTHER   OTHER   MOTHER

### Step 6. Capitalize both Mjob and Fjob

In [54]:
df2 = df[["Mjob","Fjob"]].applymap(lambda x:x.upper())
df2.head(3)

      Mjob     Fjob
0  AT_HOME  TEACHER
1  AT_HOME    OTHER
2  AT_HOME    OTHER

### Step 7. Print the last elements of the data set.

In [61]:
df.tail(1)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
1043,MS,M,18,R,LE3,T,3,2,services,other,course,mother

### Step 8. Did you notice the original dataframe is still lowercase? Why is that? Fix it and captalize Mjob and Fjob.

In [76]:
df[["Mjob","Fjob"]] = df[["Mjob","Fjob"]].applymap(lambda x:x.upper())

In [77]:
df.head(2)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,AT_HOME,TEACHER,course,mother
1,GP,F,17,U,GT3,T,1,1,AT_HOME,OTHER,course,father

### Step 9. Create a function called majority that return a boolean value to a new column called legal_drinker

In [80]:
df["legal_drinker"] = df["age"].apply(lambda x: x>18)
df.head(2)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_drinker
0,GP,F,18,U,GT3,A,4,4,AT_HOME,TEACHER,course,mother,False
1,GP,F,17,U,GT3,T,1,1,AT_HOME,OTHER,course,father,False

### Step 10. Multiply every number of the dataset by 10.

In [88]:
df[["age","Medu","Fedu"]] = df[["age","Medu","Fedu"]].applymap(lambda x:x * 10)

In [89]:
df.head(3)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_drinker
0,GP,F,180,U,GT3,A,40,40,AT_HOME,TEACHER,course,mother,False
1,GP,F,170,U,GT3,T,10,10,AT_HOME,OTHER,course,father,False
2,GP,F,150,U,LE3,T,10,10,AT_HOME,OTHER,other,mother,False